// --------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------
// -----------------------------------  урсова€ работа ----------------------------------------
// --------------------------------------------------------------------------------------------
// -------------------------‘айл заголовков дополнительных функций-----------------------------
// --------------------------------------------------------------------------------------------


// ’ранит ли база данных пустой список (true - если хранит пустой список; false - есть ли есть записи):
bool is_data_base_holding_empty_list(bus_station* bs);

// явл€етс€ ли строка типа "string" натуральным числом:
bool is_string_number(string const& str); 

// ќкажетс€ ли строка типа "string" при ее переводе в натуральное число меньшей некоторого заданного числа:
bool is_string_as_number_lower_then(string const& str, int const& n); 

// ѕозвол€ет добитьс€ от пользовател€ ввода, удовлетвор€ющего услови€м:
string get_user_input_with_conditions(int const& n, string conditions); 









